[
    {
      "time": "March 2023 - Present",
      "title": "Backend Engineer",
      "company": "GetStep",
      "desc": [
        "Developed and implemented a hybrid recommendation engine that harnessed user interactions and posts to provide personalized post and community recommendations.",
        "Engineered a microservice-based architecture for the recommendation engine, contributing to system scalability and resource efficiency.",
        "Leveraged PostgreSQL stored procedures to optimize database interactions specifically within the wallet service microservice.",
        "Integrated the recommendation engine and wallet features, collaborating with banking NIP infrastructures to streamline customer payment management.",
        "Designed and developed wallet functionalities as microservices within the architecture, ensuring modularity and maintainability."
      ],
      "tech": ["C#", ".NET Core", "Python", "Django", "PostgreSQL"]
    },
    {
      "time": "Oct 2022 - Feb 2023",
      "title": "Software Developer",
      "company": "TBO Consulting Group",
      "desc": [
        "Led the complete revamp of the company's website, enhancing the brand's digital presence and user experience.",
        "Worked on a secure JWT-based authentication system using PassportJS and applied an authorization system, enhancing platform security and data integrity.",
        "Created a user network for storing user data and generating talent recommendations based on skills, improving efficiency and personalization.",
        "Formulated and applied a responsive front-end application using Redux and React Router, improving data accessibility and platform efficiency.",
        "Built a robust project management system and automated key processes, including the Talent as a Service (TaaS) pipeline, calendar scheduling, and email notifications, leading to improved time-to-delivery and user engagement."
      ],
      "tech": ["JavaScript", "React", "Express", "MongoDB", "NodeJS"]
    },
    {
      "time": "Jun 2021 - Sep 2022",
      "title": "Full Stack Developer",
      "company": "RILA INVESTMENT",
      "desc": [
        "Engineered a robust front-end application utilizing ReactJS, serving as the public-facing interface and administrative access point, significantly improving the company's online presence",
        "Constructed a highly scalable backend API with Django, providing streamlined service management and optimized efficiency across the company's digital infrastructure.",
        "Constructed a secure administrative module, implementing granular authentication and authorization systems. This ensured appropriate access control based on user roles, including engineering staff, administrative staff, inventory personnel, and superusers.",
        "Planned and deployed a comprehensive inventory management system integrated into the website. This system tracks material and component transactions, including origin and destination data, and the personnel involved, ensuring real-time accuracy and accountability",
        "Created an innovative battery monitoring device for efficient evaluation of battery life cycles. This device is crucial for ensuring the quality of reused batteries, aligning with the commitment to sustainability in the solar energy industry"
      ],
      "tech": ["JavaScript", "React", "Python", "Django", "PostgreSQL"]
    },
    {
      "time": "May 2021 - Dec 2021",
      "title": "Software Engineer (Internship)",
      "company": "BOLDSCALE",
      "desc": [
        "Worked with a team to develop and deploy a browser forked from the chromium project.",
        "Developed stand-alone VPN solutions to be integrated with the browser using open-source technologies."
      ],
      "tech": ["C/C++", "Java"]
    }
]
  